app/Http/Repositories/CategorieRepository.php

select `libelle_categorie`, `id` from `categorie`
---
	public function getLibelleCategories(){
		$categories = $this->categorie->pluck('libelle_categorie', 'id')->toArray();