app/Http/Repositories/HabitatRepository.php

select * from `habitat` where `actif_habitat` = '1'
---
    public function getAllHabitats(){
        $habitats = $this->habitat->where('actif_habitat', 1)->get();